<template>
  <div class="content">
    <h1>プライバシーポリシー</h1>

    <div class="mt-50 p0">
      <h2 class="mt-50">個人情報の取り扱い</h2>

      <h3 class="mt-20">個人情報の利用目的</h3>
      <ul>
        <li>
          このブログでは、お問い合わせの際にメールアドレス等の個人情報を入力いただく場合があります。
        </li>
        <li>取得した個人情報は、連絡以外の用途には使用いたしません。</li>
      </ul>

      <h3 class="mt-20">個人情報の開示について</h3>
      <p>以下の場合、個人情報を第三者に開示する場合があります</p>
      <ul>
        <li>犯罪予告など法的違反な内容が含まれているお問い合わせ</li>
        <li>その他、法的な問題で開示が求められたとき</li>
      </ul>

      <h2 class="mt-50">著作権</h2>
      <ul>
        <li>
          本ブログで掲載しているすべてのコンテンツ（文章、画像、動画、音声、ファイル等）の著作権・肖像権等は、当サイト所有者または各権利所有者が保有します。
        </li>
        <li>
          許可なく本ブログのコンテンツを以下のように無断で利用することは禁止しています。
          <ul>
            <li>転載</li>
            <li>複製</li>
            <li>譲渡</li>
            <li>二次利用</li>
            <li>引用元を記載しない</li>
          </ul>
        </li>
        <li>
          第三者の権利を侵害しないように配慮していますが、本ブログの記事等にて問題が発生した場合、<nuxt-link
            to="/contact"
            >お問い合わせ</nuxt-link
          >にてお伝えください。
        </li>
      </ul>

      <h3 class="mt-20">使用している広告・解析ツール</h3>
      <ul>
        <li>Googleアナリティクス</li>
        <li>
          実装予定
          <ul>
            <li>Google Adsense</li>
          </ul>
        </li>
      </ul>

      <h3 class="mt-20">Cookieについて</h3>
      <ul>
        <li>
          本ブログに、Cookieを利用したシステムはGoogleアナリティクスだけです。
        </li>
        <li>
          第三者への情報の開示は、法的な開示請求が求められた場合のみです。
        </li>
      </ul>

      <h2 class="mt-50">免責事項</h2>
      <ul>
        <li>
          『本ブログ』および『当ブログに記載されたリンク先』によって生じた損害に対する一切の責任を負いかねます。
        </li>
        <li>
          プログラミングに関する記事に関しては、バージョンや環境の違い、ブログの記載ミスに正常に稼働しない場合がございます。
        </li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  name: "index",
  head() {
    return {
      title: "プライバシーポリシー",
    };
  },
};
</script>
